w3ichen/haptic-hand/stm32f4xx_tim_mort.h
  uint16_t TIM_ICFilter;     /*!< Specifies the input capture filter.
                                  This parameter can be a number between 0x0 and 0xF */
} TIM_ICInitTypeDef_mort;

/** 
  * @brief  BDTR structure definition 
  * @note   This structure is used only with TIM1_MORT and TIM8_MORT.    
  */

typedef struct
{

  uint16_t TIM_OSSRState;        /*!< Specifies the Off-State selection used in Run mode.
                                      This parameter can be a value of @ref TIM_OSSR_Off_State_Selection_for_Run_mode_state */

  uint16_t TIM_OSSIState;        /*!< Specifies the Off-State used in Idle state.
                                      This parameter can be a value of @ref TIM_OSSI_Off_State_Selection_for_Idle_mode_state */

  uint16_t TIM_LOCKLevel;        /*!< Specifies the LOCK level parameters.
                                      This parameter can be a value of @ref TIM_Lock_level */ 

  uint16_t TIM_DeadTime;         /*!< Specifies the delay time between the switching-off and the
                                      switching-on of the outputs.
                                      This parameter can be a number between 0x00 and 0xFF  */

  uint16_t TIM_Break;            /*!< Specifies whether the TIM Break input is enabled or not. 
                                      This parameter can be a value of @ref TIM_Break_Input_enable_disable */

  uint16_t TIM_BreakPolarity;    /*!< Specifies the TIM Break Input pin polarity.
                                      This parameter can be a value of @ref TIM_Break_Polarity */

  uint16_t TIM_AutomaticOutput;  /*!< Specifies whether the TIM Automatic Output feature is enabled or not. 
                                      This parameter can be a value of @ref TIM_AOE_Bit_Set_Reset */
} TIM_BDTRInitTypeDef_mort;

/* Exported constants --------------------------------------------------------*/

/** @defgroup TIM_Exported_constants 
  * @{
  */

#define IS_TIM_ALL_PERIPH_MORT(PERIPH) (((PERIPH) == TIM1_MORT) || \
                                   ((PERIPH) == TIM2_MORT) || \
                                   ((PERIPH) == TIM3_MORT) || \
                                   ((PERIPH) == TIM4_MORT) || \
                                   ((PERIPH) == TIM5_MORT) || \
                                   ((PERIPH) == TIM6_MORT) || \
                                   ((PERIPH) == TIM7_MORT) || \
                                   ((PERIPH) == TIM8_MORT) || \
                                   ((PERIPH) == TIM9_MORT) || \
                                   ((PERIPH) == TIM10_MORT) || \
                                   ((PERIPH) == TIM11_MORT) || \
                                   ((PERIPH) == TIM12_MORT) || \
                                   (((PERIPH) == TIM13_MORT) || \
                                   ((PERIPH) == TIM14_MORT)))
/* LIST1: TIM1_MORT, TIM2_MORT, TIM3_MORT, TIM4_MORT, TIM5_MORT, TIM8_MORT, TIM9_MORT, TIM10_MORT, TIM11_MORT, TIM12_MORT, TIM13_MORT and TIM14_MORT */                                         
#define IS_TIM_LIST1_PERIPH_MORT(PERIPH) (((PERIPH) == TIM1_MORT) || \
                                     ((PERIPH) == TIM2_MORT) || \
                                     ((PERIPH) == TIM3_MORT) || \
                                     ((PERIPH) == TIM4_MORT) || \
                                     ((PERIPH) == TIM5_MORT) || \
                                     ((PERIPH) == TIM8_MORT) || \
                                     ((PERIPH) == TIM9_MORT) || \
                                     ((PERIPH) == TIM10_MORT) || \
                                     ((PERIPH) == TIM11_MORT) || \
                                     ((PERIPH) == TIM12_MORT) || \
                                     ((PERIPH) == TIM13_MORT) || \
                                     ((PERIPH) == TIM14_MORT))
                                     
/* LIST2: TIM1_MORT, TIM2_MORT, TIM3_MORT, TIM4_MORT, TIM5_MORT, TIM8_MORT, TIM9_MORT and TIM12_MORT */
#define IS_TIM_LIST2_PERIPH_MORT(PERIPH) (((PERIPH) == TIM1_MORT) || \
                                     ((PERIPH) == TIM2_MORT) || \
                                     ((PERIPH) == TIM3_MORT) || \
                                     ((PERIPH) == TIM4_MORT) || \
                                     ((PERIPH) == TIM5_MORT) || \
                                     ((PERIPH) == TIM8_MORT) || \
                                     ((PERIPH) == TIM9_MORT) || \
                                     ((PERIPH) == TIM12_MORT))
/* LIST3: TIM1_MORT, TIM2_MORT, TIM3_MORT, TIM4_MORT, TIM5_MORT and TIM8_MORT */
#define IS_TIM_LIST3_PERIPH_MORT(PERIPH) (((PERIPH) == TIM1_MORT) || \
                                     ((PERIPH) == TIM2_MORT) || \
                                     ((PERIPH) == TIM3_MORT) || \
                                     ((PERIPH) == TIM4_MORT) || \
                                     ((PERIPH) == TIM5_MORT) || \
                                     ((PERIPH) == TIM8_MORT))
/* LIST4: TIM1_MORT and TIM8_MORT */
#define IS_TIM_LIST4_PERIPH_MORT(PERIPH) (((PERIPH) == TIM1_MORT) || \
                                     ((PERIPH) == TIM8_MORT))
/* LIST5: TIM1_MORT, TIM2_MORT, TIM3_MORT, TIM4_MORT, TIM5_MORT, TIM6_MORT, TIM7_MORT and TIM8_MORT */
#define IS_TIM_LIST5_PERIPH_MORT(PERIPH) (((PERIPH) == TIM1_MORT) || \
                                     ((PERIPH) == TIM2_MORT) || \
                                     ((PERIPH) == TIM3_MORT) || \
                                     ((PERIPH) == TIM4_MORT) || \
                                     ((PERIPH) == TIM5_MORT) || \
                                     ((PERIPH) == TIM6_MORT) || \
                                     ((PERIPH) == TIM7_MORT) || \
                                     ((PERIPH) == TIM8_MORT))
/* LIST6: TIM2_MORT, TIM5_MORT and TIM11_MORT */                               
#define IS_TIM_LIST6_PERIPH_MORT(TIMx)(((TIMx) == TIM2_MORT) || \
                                 ((TIMx) == TIM5_MORT) || \
                                 ((TIMx) == TIM11_MORT))

/** @defgroup TIM_Output_Compare_and_PWM_modes 
  * @{
  */

#define TIM_OCMode_Timing_MORT                  ((uint16_t)0x0000)
#define TIM_OCMode_Active_MORT                  ((uint16_t)0x0010)
#define TIM_OCMode_Inactive_MORT                ((uint16_t)0x0020)
#define TIM_OCMode_Toggle_MORT                  ((uint16_t)0x0030)
#define TIM_OCMode_PWM1_MORT                    ((uint16_t)0x0060)
#define TIM_OCMode_PWM2_MORT                    ((uint16_t)0x0070)
#define IS_TIM_OC_MODE_MORT(MODE) (((MODE) == TIM_OCMode_Timing_MORT) || \
                              ((MODE) == TIM_OCMode_Active_MORT) || \
                              ((MODE) == TIM_OCMode_Inactive_MORT) || \
                              ((MODE) == TIM_OCMode_Toggle_MORT)|| \
                              ((MODE) == TIM_OCMode_PWM1_MORT) || \
                              ((MODE) == TIM_OCMode_PWM2_MORT))
#define IS_TIM_OCM_MORT(MODE) (((MODE) == TIM_OCMode_Timing_MORT) || \
                          ((MODE) == TIM_OCMode_Active_MORT) || \
                          ((MODE) == TIM_OCMode_Inactive_MORT) || \
                          ((MODE) == TIM_OCMode_Toggle_MORT)|| \
                          ((MODE) == TIM_OCMode_PWM1_MORT) || \
                          ((MODE) == TIM_OCMode_PWM2_MORT) ||	\
                          ((MODE) == TIM_ForcedAction_Active_MORT) || \
                          ((MODE) == TIM_ForcedAction_InActive_MORT))
/**
  * @}
  */

/** @defgroup TIM_One_Pulse_Mode 
  * @{
  */

#define TIM_OPMode_Single_MORT                  ((uint16_t)0x0008)
#define TIM_OPMode_Repetitive_MORT              ((uint16_t)0x0000)
#define IS_TIM_OPM_MODE_MORT(MODE) (((MODE) == TIM_OPMode_Single_MORT) || \
                               ((MODE) == TIM_OPMode_Repetitive_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Channel 
  * @{
  */

#define TIM_Channel_1_MORT                      ((uint16_t)0x0000)
#define TIM_Channel_2_MORT                      ((uint16_t)0x0004)
#define TIM_Channel_3_MORT                      ((uint16_t)0x0008)
#define TIM_Channel_4_MORT                      ((uint16_t)0x000C)
                                 
#define IS_TIM_CHANNEL_MORT(CHANNEL) (((CHANNEL) == TIM_Channel_1_MORT) || \
                                 ((CHANNEL) == TIM_Channel_2_MORT) || \
                                 ((CHANNEL) == TIM_Channel_3_MORT) || \
                                 ((CHANNEL) == TIM_Channel_4_MORT))
                                 
#define IS_TIM_PWMI_CHANNEL_MORT(CHANNEL) (((CHANNEL) == TIM_Channel_1_MORT) || \
                                      ((CHANNEL) == TIM_Channel_2_MORT))
#define IS_TIM_COMPLEMENTARY_CHANNEL_MORT(CHANNEL) (((CHANNEL) == TIM_Channel_1_MORT) || \
                                               ((CHANNEL) == TIM_Channel_2_MORT) || \
                                               ((CHANNEL) == TIM_Channel_3_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Clock_Division_CKD 
  * @{
  */

#define TIM_CKD_DIV1_MORT                       ((uint16_t)0x0000)
#define TIM_CKD_DIV2_MORT                       ((uint16_t)0x0100)
#define TIM_CKD_DIV4_MORT                       ((uint16_t)0x0200)
#define IS_TIM_CKD_DIV_MORT(DIV) (((DIV) == TIM_CKD_DIV1_MORT) || \
                             ((DIV) == TIM_CKD_DIV2_MORT) || \
                             ((DIV) == TIM_CKD_DIV4_MORT))
/**
  * @}
  */

/** @defgroup TIM_Counter_Mode 
  * @{
  */

