w3ichen/haptic-hand/stm32f4xx_tim_mort.h
#define TIM_CounterMode_Up_MORT                 ((uint16_t)0x0000)
#define TIM_CounterMode_Down_MORT               ((uint16_t)0x0010)
#define TIM_CounterMode_CenterAligned1_MORT     ((uint16_t)0x0020)
#define TIM_CounterMode_CenterAligned2_MORT     ((uint16_t)0x0040)
#define TIM_CounterMode_CenterAligned3_MORT     ((uint16_t)0x0060)
#define IS_TIM_COUNTER_MODE_MORT(MODE) (((MODE) == TIM_CounterMode_Up_MORT) ||  \
                                   ((MODE) == TIM_CounterMode_Down_MORT) || \
                                   ((MODE) == TIM_CounterMode_CenterAligned1_MORT) || \
                                   ((MODE) == TIM_CounterMode_CenterAligned2_MORT) || \
                                   ((MODE) == TIM_CounterMode_CenterAligned3_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Polarity 
  * @{
  */

#define TIM_OCPolarity_High_MORT                ((uint16_t)0x0000)
#define TIM_OCPolarity_Low_MORT                 ((uint16_t)0x0002)
#define IS_TIM_OC_POLARITY_MORT(POLARITY) (((POLARITY) == TIM_OCPolarity_High_MORT) || \
                                      ((POLARITY) == TIM_OCPolarity_Low_MORT))
/**
  * @}
  */

/** @defgroup TIM_Output_Compare_N_Polarity 
  * @{
  */
  
#define TIM_OCNPolarity_High_MORT               ((uint16_t)0x0000)
#define TIM_OCNPolarity_Low_MORT                ((uint16_t)0x0008)
#define IS_TIM_OCN_POLARITY_MORT(POLARITY) (((POLARITY) == TIM_OCNPolarity_High_MORT) || \
                                       ((POLARITY) == TIM_OCNPolarity_Low_MORT))
/**
  * @}
  */

/** @defgroup TIM_Output_Compare_State 
  * @{
  */

#define TIM_OutputState_Disable_MORT            ((uint16_t)0x0000)
#define TIM_OutputState_Enable_MORT             ((uint16_t)0x0001)
#define IS_TIM_OUTPUT_STATE_MORT(STATE) (((STATE) == TIM_OutputState_Disable_MORT) || \
                                    ((STATE) == TIM_OutputState_Enable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_N_State
  * @{
  */

#define TIM_OutputNState_Disable_MORT           ((uint16_t)0x0000)
#define TIM_OutputNState_Enable_MORT            ((uint16_t)0x0004)
#define IS_TIM_OUTPUTN_STATE_MORT(STATE) (((STATE) == TIM_OutputNState_Disable_MORT) || \
                                     ((STATE) == TIM_OutputNState_Enable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Capture_Compare_State
  * @{
  */

#define TIM_CCx_Enable_MORT                      ((uint16_t)0x0001)
#define TIM_CCx_Disable_MORT                     ((uint16_t)0x0000)
#define IS_TIM_CCX_MORT(CCX) (((CCX) == TIM_CCx_Enable_MORT) || \
                         ((CCX) == TIM_CCx_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Capture_Compare_N_State
  * @{
  */

#define TIM_CCxN_Enable_MORT                     ((uint16_t)0x0004)
#define TIM_CCxN_Disable_MORT                    ((uint16_t)0x0000)
#define IS_TIM_CCXN_MORT(CCXN) (((CCXN) == TIM_CCxN_Enable_MORT) || \
                           ((CCXN) == TIM_CCxN_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Break_Input_enable_disable 
  * @{
  */

#define TIM_Break_Enable_MORT                   ((uint16_t)0x1000)
#define TIM_Break_Disable_MORT                  ((uint16_t)0x0000)
#define IS_TIM_BREAK_STATE_MORT(STATE) (((STATE) == TIM_Break_Enable_MORT) || \
                                   ((STATE) == TIM_Break_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Break_Polarity 
  * @{
  */

#define TIM_BreakPolarity_Low_MORT              ((uint16_t)0x0000)
#define TIM_BreakPolarity_High_MORT             ((uint16_t)0x2000)
#define IS_TIM_BREAK_POLARITY_MORT(POLARITY) (((POLARITY) == TIM_BreakPolarity_Low_MORT) || \
                                         ((POLARITY) == TIM_BreakPolarity_High_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_AOE_Bit_Set_Reset 
  * @{
  */

#define TIM_AutomaticOutput_Enable_MORT         ((uint16_t)0x4000)
#define TIM_AutomaticOutput_Disable_MORT        ((uint16_t)0x0000)
#define IS_TIM_AUTOMATIC_OUTPUT_STATE_MORT(STATE) (((STATE) == TIM_AutomaticOutput_Enable_MORT) || \
                                              ((STATE) == TIM_AutomaticOutput_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Lock_level
  * @{
  */

#define TIM_LOCKLevel_OFF_MORT                  ((uint16_t)0x0000)
#define TIM_LOCKLevel_1_MORT                    ((uint16_t)0x0100)
#define TIM_LOCKLevel_2_MORT                    ((uint16_t)0x0200)
#define TIM_LOCKLevel_3_MORT                    ((uint16_t)0x0300)
#define IS_TIM_LOCK_LEVEL_MORT(LEVEL) (((LEVEL) == TIM_LOCKLevel_OFF_MORT) || \
                                  ((LEVEL) == TIM_LOCKLevel_1_MORT) || \
                                  ((LEVEL) == TIM_LOCKLevel_2_MORT) || \
                                  ((LEVEL) == TIM_LOCKLevel_3_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_OSSI_Off_State_Selection_for_Idle_mode_state 
  * @{
  */

#define TIM_OSSIState_Enable_MORT               ((uint16_t)0x0400)
#define TIM_OSSIState_Disable_MORT              ((uint16_t)0x0000)
#define IS_TIM_OSSI_STATE_MORT(STATE) (((STATE) == TIM_OSSIState_Enable_MORT) || \
                                  ((STATE) == TIM_OSSIState_Disable_MORT))
/**
  * @}
  */

/** @defgroup TIM_OSSR_Off_State_Selection_for_Run_mode_state
  * @{
  */

#define TIM_OSSRState_Enable_MORT               ((uint16_t)0x0800)
#define TIM_OSSRState_Disable_MORT              ((uint16_t)0x0000)
#define IS_TIM_OSSR_STATE_MORT(STATE) (((STATE) == TIM_OSSRState_Enable_MORT) || \
                                  ((STATE) == TIM_OSSRState_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Idle_State 
  * @{
  */

#define TIM_OCIdleState_Set_MORT                ((uint16_t)0x0100)
#define TIM_OCIdleState_Reset_MORT              ((uint16_t)0x0000)
#define IS_TIM_OCIDLE_STATE_MORT(STATE) (((STATE) == TIM_OCIdleState_Set_MORT) || \
                                    ((STATE) == TIM_OCIdleState_Reset_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_N_Idle_State 
  * @{
  */

#define TIM_OCNIdleState_Set_MORT               ((uint16_t)0x0200)
#define TIM_OCNIdleState_Reset_MORT             ((uint16_t)0x0000)
#define IS_TIM_OCNIDLE_STATE_MORT(STATE) (((STATE) == TIM_OCNIdleState_Set_MORT) || \
                                     ((STATE) == TIM_OCNIdleState_Reset_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Polarity 
  * @{
  */

#define  TIM_ICPolarity_Rising_MORT             ((uint16_t)0x0000)
#define  TIM_ICPolarity_Falling_MORT            ((uint16_t)0x0002)
#define  TIM_ICPolarity_BothEdge_MORT           ((uint16_t)0x000A)
#define IS_TIM_IC_POLARITY_MORT(POLARITY) (((POLARITY) == TIM_ICPolarity_Rising_MORT) || \
                                      ((POLARITY) == TIM_ICPolarity_Falling_MORT)|| \
                                      ((POLARITY) == TIM_ICPolarity_BothEdge_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Selection 
  * @{
  */

#define TIM_ICSelection_DirectTI_MORT           ((uint16_t)0x0001) /*!< TIM Input 1, 2, 3 or 4 is selected to be 
                                                                   connected to IC1, IC2, IC3 or IC4, respectively */
#define TIM_ICSelection_IndirectTI_MORT         ((uint16_t)0x0002) /*!< TIM Input 1, 2, 3 or 4 is selected to be
                                                                   connected to IC2, IC1, IC4 or IC3, respectively. */
#define TIM_ICSelection_TRC_MORT                ((uint16_t)0x0003) /*!< TIM Input 1, 2, 3 or 4 is selected to be connected to TRC. */
#define IS_TIM_IC_SELECTION_MORT(SELECTION) (((SELECTION) == TIM_ICSelection_DirectTI_MORT) || \
                                        ((SELECTION) == TIM_ICSelection_IndirectTI_MORT) || \
                                        ((SELECTION) == TIM_ICSelection_TRC_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Prescaler 
  * @{
  */

#define TIM_ICPSC_DIV1_MORT                     ((uint16_t)0x0000) /*!< Capture performed each time an edge is detected on the capture input. */
#define TIM_ICPSC_DIV2_MORT                     ((uint16_t)0x0004) /*!< Capture performed once every 2 events. */
#define TIM_ICPSC_DIV4_MORT                     ((uint16_t)0x0008) /*!< Capture performed once every 4 events. */
#define TIM_ICPSC_DIV8_MORT                     ((uint16_t)0x000C) /*!< Capture performed once every 8 events. */
#define IS_TIM_IC_PRESCALER_MORT(PRESCALER) (((PRESCALER) == TIM_ICPSC_DIV1_MORT) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV2_MORT) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV4_MORT) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV8_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_interrupt_sources 
  * @{
  */

#define TIM_IT_Update_MORT                      ((uint16_t)0x0001)
#define TIM_IT_CC1_MORT                         ((uint16_t)0x0002)
#define TIM_IT_CC2_MORT                         ((uint16_t)0x0004)
#define TIM_IT_CC3_MORT                         ((uint16_t)0x0008)
#define TIM_IT_CC4_MORT                         ((uint16_t)0x0010)
#define TIM_IT_COM_MORT                         ((uint16_t)0x0020)
#define TIM_IT_Trigger_MORT                     ((uint16_t)0x0040)
#define TIM_IT_Break_MORT                       ((uint16_t)0x0080)
#define IS_TIM_IT_MORT(IT) ((((IT) & (uint16_t)0xFF00) == 0x0000) && ((IT) != 0x0000))

#define IS_TIM_GET_IT_MORT(IT) (((IT) == TIM_IT_Update_MORT) || \
                           ((IT) == TIM_IT_CC1_MORT) || \
                           ((IT) == TIM_IT_CC2_MORT) || \
                           ((IT) == TIM_IT_CC3_MORT) || \
                           ((IT) == TIM_IT_CC4_MORT) || \
                           ((IT) == TIM_IT_COM_MORT) || \
                           ((IT) == TIM_IT_Trigger_MORT) || \
                           ((IT) == TIM_IT_Break_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_DMA_Base_address 
  * @{
  */

#define TIM_DMABase_CR1_MORT                    ((uint16_t)0x0000)
#define TIM_DMABase_CR2_MORT                    ((uint16_t)0x0001)
#define TIM_DMABase_SMCR_MORT                   ((uint16_t)0x0002)
#define TIM_DMABase_DIER_MORT                   ((uint16_t)0x0003)
#define TIM_DMABase_SR_MORT                     ((uint16_t)0x0004)
#define TIM_DMABase_EGR_MORT                    ((uint16_t)0x0005)
#define TIM_DMABase_CCMR1_MORT                  ((uint16_t)0x0006)
#define TIM_DMABase_CCMR2_MORT                  ((uint16_t)0x0007)
#define TIM_DMABase_CCER_MORT                   ((uint16_t)0x0008)
#define TIM_DMABase_CNT_MORT                    ((uint16_t)0x0009)
#define TIM_DMABase_PSC_MORT                    ((uint16_t)0x000A)
#define TIM_DMABase_ARR_MORT                    ((uint16_t)0x000B)
#define TIM_DMABase_RCR_MORT                    ((uint16_t)0x000C)
#define TIM_DMABase_CCR1_MORT                   ((uint16_t)0x000D)
#define TIM_DMABase_CCR2_MORT                   ((uint16_t)0x000E)
#define TIM_DMABase_CCR3_MORT                   ((uint16_t)0x000F)
#define TIM_DMABase_CCR4_MORT                   ((uint16_t)0x0010)
#define TIM_DMABase_BDTR_MORT                   ((uint16_t)0x0011)
#define TIM_DMABase_DCR_MORT                    ((uint16_t)0x0012)
#define TIM_DMABase_OR_MORT                     ((uint16_t)0x0013)
#define IS_TIM_DMA_BASE_MORT(BASE) (((BASE) == TIM_DMABase_CR1_MORT) || \
                               ((BASE) == TIM_DMABase_CR2_MORT) || \
                               ((BASE) == TIM_DMABase_SMCR_MORT) || \
                               ((BASE) == TIM_DMABase_DIER_MORT) || \
                               ((BASE) == TIM_DMABase_SR_MORT) || \
                               ((BASE) == TIM_DMABase_EGR_MORT) || \
                               ((BASE) == TIM_DMABase_CCMR1_MORT) || \
                               ((BASE) == TIM_DMABase_CCMR2_MORT) || \
                               ((BASE) == TIM_DMABase_CCER_MORT) || \
                               ((BASE) == TIM_DMABase_CNT_MORT) || \
                               ((BASE) == TIM_DMABase_PSC_MORT) || \
                               ((BASE) == TIM_DMABase_ARR_MORT) || \
                               ((BASE) == TIM_DMABase_RCR_MORT) || \
                               ((BASE) == TIM_DMABase_CCR1_MORT) || \
                               ((BASE) == TIM_DMABase_CCR2_MORT) || \
                               ((BASE) == TIM_DMABase_CCR3_MORT) || \
                               ((BASE) == TIM_DMABase_CCR4_MORT) || \
                               ((BASE) == TIM_DMABase_BDTR_MORT) || \
                               ((BASE) == TIM_DMABase_DCR_MORT) || \
                               ((BASE) == TIM_DMABase_OR_MORT))                     
/**
  * @}
  */ 

/** @defgroup TIM_DMA_Burst_Length 
  * @{
  */

#define TIM_DMABurstLength_1Transfer_MORT           ((uint16_t)0x0000)
#define TIM_DMABurstLength_2Transfers_MORT          ((uint16_t)0x0100)
#define TIM_DMABurstLength_3Transfers_MORT          ((uint16_t)0x0200)
#define TIM_DMABurstLength_4Transfers_MORT          ((uint16_t)0x0300)
#define TIM_DMABurstLength_5Transfers_MORT          ((uint16_t)0x0400)
#define TIM_DMABurstLength_6Transfers_MORT          ((uint16_t)0x0500)
#define TIM_DMABurstLength_7Transfers_MORT          ((uint16_t)0x0600)
#define TIM_DMABurstLength_8Transfers_MORT          ((uint16_t)0x0700)
#define TIM_DMABurstLength_9Transfers_MORT          ((uint16_t)0x0800)
#define TIM_DMABurstLength_10Transfers_MORT         ((uint16_t)0x0900)
#define TIM_DMABurstLength_11Transfers_MORT         ((uint16_t)0x0A00)
#define TIM_DMABurstLength_12Transfers_MORT         ((uint16_t)0x0B00)
#define TIM_DMABurstLength_13Transfers_MORT         ((uint16_t)0x0C00)
#define TIM_DMABurstLength_14Transfers_MORT         ((uint16_t)0x0D00)
#define TIM_DMABurstLength_15Transfers_MORT         ((uint16_t)0x0E00)
#define TIM_DMABurstLength_16Transfers_MORT         ((uint16_t)0x0F00)
#define TIM_DMABurstLength_17Transfers_MORT         ((uint16_t)0x1000)
#define TIM_DMABurstLength_18Transfers_MORT         ((uint16_t)0x1100)
#define IS_TIM_DMA_LENGTH_MORT(LENGTH) (((LENGTH) == TIM_DMABurstLength_1Transfer_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_2Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_3Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_4Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_5Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_6Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_7Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_8Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_9Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_10Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_11Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_12Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_13Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_14Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_15Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_16Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_17Transfers_MORT) || \
                                   ((LENGTH) == TIM_DMABurstLength_18Transfers_MORT))
/**
  * @}
  */ 

