w3ichen/haptic-hand/stm32f4xx_tim_mort.h
/** @defgroup TIM_DMA_sources 
  * @{
  */

#define TIM_DMA_Update_MORT                     ((uint16_t)0x0100)
#define TIM_DMA_CC1_MORT                        ((uint16_t)0x0200)
#define TIM_DMA_CC2_MORT                        ((uint16_t)0x0400)
#define TIM_DMA_CC3_MORT                        ((uint16_t)0x0800)
#define TIM_DMA_CC4_MORT                        ((uint16_t)0x1000)
#define TIM_DMA_COM_MORT                        ((uint16_t)0x2000)
#define TIM_DMA_Trigger_MORT                    ((uint16_t)0x4000)
#define IS_TIM_DMA_SOURCE_MORT(SOURCE) ((((SOURCE) & (uint16_t)0x80FF) == 0x0000) && ((SOURCE) != 0x0000))

/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Prescaler 
  * @{
  */

#define TIM_ExtTRGPSC_OFF_MORT                  ((uint16_t)0x0000)
#define TIM_ExtTRGPSC_DIV2_MORT                 ((uint16_t)0x1000)
#define TIM_ExtTRGPSC_DIV4_MORT                 ((uint16_t)0x2000)
#define TIM_ExtTRGPSC_DIV8_MORT                 ((uint16_t)0x3000)
#define IS_TIM_EXT_PRESCALER_MORT(PRESCALER) (((PRESCALER) == TIM_ExtTRGPSC_OFF_MORT) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV2_MORT) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV4_MORT) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV8_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Internal_Trigger_Selection 
  * @{
  */

#define TIM_TS_ITR0_MORT                        ((uint16_t)0x0000)
#define TIM_TS_ITR1_MORT                        ((uint16_t)0x0010)
#define TIM_TS_ITR2_MORT                        ((uint16_t)0x0020)
#define TIM_TS_ITR3_MORT                        ((uint16_t)0x0030)
#define TIM_TS_TI1F_ED_MORT                     ((uint16_t)0x0040)
#define TIM_TS_TI1FP1_MORT                      ((uint16_t)0x0050)
#define TIM_TS_TI2FP2_MORT                      ((uint16_t)0x0060)
#define TIM_TS_ETRF_MORT                        ((uint16_t)0x0070)
#define IS_TIM_TRIGGER_SELECTION_MORT(SELECTION) (((SELECTION) == TIM_TS_ITR0_MORT) || \
                                             ((SELECTION) == TIM_TS_ITR1_MORT) || \
                                             ((SELECTION) == TIM_TS_ITR2_MORT) || \
                                             ((SELECTION) == TIM_TS_ITR3_MORT) || \
                                             ((SELECTION) == TIM_TS_TI1F_ED_MORT) || \
                                             ((SELECTION) == TIM_TS_TI1FP1_MORT) || \
                                             ((SELECTION) == TIM_TS_TI2FP2_MORT) || \
                                             ((SELECTION) == TIM_TS_ETRF_MORT))
#define IS_TIM_INTERNAL_TRIGGER_SELECTION_MORT(SELECTION) (((SELECTION) == TIM_TS_ITR0_MORT) || \
                                                      ((SELECTION) == TIM_TS_ITR1_MORT) || \
                                                      ((SELECTION) == TIM_TS_ITR2_MORT) || \
                                                      ((SELECTION) == TIM_TS_ITR3_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_TIx_External_Clock_Source 
  * @{
  */

#define TIM_TIxExternalCLK1Source_TI1_MORT      ((uint16_t)0x0050)
#define TIM_TIxExternalCLK1Source_TI2_MORT      ((uint16_t)0x0060)
#define TIM_TIxExternalCLK1Source_TI1ED_MORT    ((uint16_t)0x0040)

/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Polarity 
  * @{
  */ 
#define TIM_ExtTRGPolarity_Inverted_MORT        ((uint16_t)0x8000)
#define TIM_ExtTRGPolarity_NonInverted_MORT     ((uint16_t)0x0000)
#define IS_TIM_EXT_POLARITY_MORT(POLARITY) (((POLARITY) == TIM_ExtTRGPolarity_Inverted_MORT) || \
                                       ((POLARITY) == TIM_ExtTRGPolarity_NonInverted_MORT))
/**
  * @}
  */

/** @defgroup TIM_Prescaler_Reload_Mode 
  * @{
  */

#define TIM_PSCReloadMode_Update_MORT           ((uint16_t)0x0000)
#define TIM_PSCReloadMode_Immediate_MORT        ((uint16_t)0x0001)
#define IS_TIM_PRESCALER_RELOAD_MORT(RELOAD) (((RELOAD) == TIM_PSCReloadMode_Update_MORT) || \
                                         ((RELOAD) == TIM_PSCReloadMode_Immediate_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Forced_Action 
  * @{
  */

#define TIM_ForcedAction_Active_MORT            ((uint16_t)0x0050)
#define TIM_ForcedAction_InActive_MORT          ((uint16_t)0x0040)
#define IS_TIM_FORCED_ACTION_MORT(ACTION) (((ACTION) == TIM_ForcedAction_Active_MORT) || \
                                      ((ACTION) == TIM_ForcedAction_InActive_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Encoder_Mode 
  * @{
  */

#define TIM_EncoderMode_TI1_MORT                ((uint16_t)0x0001)
#define TIM_EncoderMode_TI2_MORT                ((uint16_t)0x0002)
#define TIM_EncoderMode_TI12_MORT               ((uint16_t)0x0003)
#define IS_TIM_ENCODER_MODE_MORT(MODE) (((MODE) == TIM_EncoderMode_TI1_MORT) || \
                                   ((MODE) == TIM_EncoderMode_TI2_MORT) || \
                                   ((MODE) == TIM_EncoderMode_TI12_MORT))
/**
  * @}
  */ 


/** @defgroup TIM_Event_Source 
  * @{
  */

#define TIM_EventSource_Update_MORT             ((uint16_t)0x0001)
#define TIM_EventSource_CC1_MORT                ((uint16_t)0x0002)
#define TIM_EventSource_CC2_MORT                ((uint16_t)0x0004)
#define TIM_EventSource_CC3_MORT                ((uint16_t)0x0008)
#define TIM_EventSource_CC4_MORT                ((uint16_t)0x0010)
#define TIM_EventSource_COM_MORT                ((uint16_t)0x0020)
#define TIM_EventSource_Trigger_MORT            ((uint16_t)0x0040)
#define TIM_EventSource_Break_MORT              ((uint16_t)0x0080)
#define IS_TIM_EVENT_SOURCE_MORT(SOURCE) ((((SOURCE) & (uint16_t)0xFF00) == 0x0000) && ((SOURCE) != 0x0000))                                          
  
/**
  * @}
  */ 

/** @defgroup TIM_Update_Source 
  * @{
  */

#define TIM_UpdateSource_Global_MORT            ((uint16_t)0x0000) /*!< Source of update is the counter overflow/underflow
                                                                   or the setting of UG bit, or an update generation
                                                                   through the slave mode controller. */
#define TIM_UpdateSource_Regular_MORT           ((uint16_t)0x0001) /*!< Source of update is counter overflow/underflow. */
#define IS_TIM_UPDATE_SOURCE_MORT(SOURCE) (((SOURCE) == TIM_UpdateSource_Global_MORT) || \
                                      ((SOURCE) == TIM_UpdateSource_Regular_MORT))
/**
  * @}
  */ 

