w3ichen/haptic-hand/stm32f4xx_tim_mort.h
/** @defgroup TIM_Output_Compare_Preload_State 
  * @{
  */

#define TIM_OCPreload_Enable_MORT               ((uint16_t)0x0008)
#define TIM_OCPreload_Disable_MORT              ((uint16_t)0x0000)
#define IS_TIM_OCPRELOAD_STATE_MORT(STATE) (((STATE) == TIM_OCPreload_Enable_MORT) || \
                                       ((STATE) == TIM_OCPreload_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Fast_State 
  * @{
  */

#define TIM_OCFast_Enable_MORT                  ((uint16_t)0x0004)
#define TIM_OCFast_Disable_MORT                 ((uint16_t)0x0000)
#define IS_TIM_OCFAST_STATE_MORT(STATE) (((STATE) == TIM_OCFast_Enable_MORT) || \
                                    ((STATE) == TIM_OCFast_Disable_MORT))
                                     
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Clear_State 
  * @{
  */

#define TIM_OCClear_Enable_MORT                 ((uint16_t)0x0080)
#define TIM_OCClear_Disable_MORT                ((uint16_t)0x0000)
#define IS_TIM_OCCLEAR_STATE_MORT(STATE) (((STATE) == TIM_OCClear_Enable_MORT) || \
                                     ((STATE) == TIM_OCClear_Disable_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Trigger_Output_Source 
  * @{
  */

#define TIM_TRGOSource_Reset_MORT               ((uint16_t)0x0000)
#define TIM_TRGOSource_Enable_MORT              ((uint16_t)0x0010)
#define TIM_TRGOSource_Update_MORT              ((uint16_t)0x0020)
#define TIM_TRGOSource_OC1_MORT                 ((uint16_t)0x0030)
#define TIM_TRGOSource_OC1Ref_MORT              ((uint16_t)0x0040)
#define TIM_TRGOSource_OC2Ref_MORT              ((uint16_t)0x0050)
#define TIM_TRGOSource_OC3Ref_MORT              ((uint16_t)0x0060)
#define TIM_TRGOSource_OC4Ref_MORT              ((uint16_t)0x0070)
#define IS_TIM_TRGO_SOURCE_MORT(SOURCE) (((SOURCE) == TIM_TRGOSource_Reset_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_Enable_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_Update_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1Ref_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_OC2Ref_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_OC3Ref_MORT) || \
                                    ((SOURCE) == TIM_TRGOSource_OC4Ref_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Slave_Mode 
  * @{
  */

#define TIM_SlaveMode_Reset_MORT                ((uint16_t)0x0004)
#define TIM_SlaveMode_Gated_MORT                ((uint16_t)0x0005)
#define TIM_SlaveMode_Trigger_MORT              ((uint16_t)0x0006)
#define TIM_SlaveMode_External1_MORT            ((uint16_t)0x0007)
#define IS_TIM_SLAVE_MODE_MORT(MODE) (((MODE) == TIM_SlaveMode_Reset_MORT) || \
                                 ((MODE) == TIM_SlaveMode_Gated_MORT) || \
                                 ((MODE) == TIM_SlaveMode_Trigger_MORT) || \
                                 ((MODE) == TIM_SlaveMode_External1_MORT))
/**
  * @}
  */ 

/** @defgroup TIM_Master_Slave_Mode 
  * @{
  */

#define TIM_MasterSlaveMode_Enable_MORT         ((uint16_t)0x0080)
#define TIM_MasterSlaveMode_Disable_MORT        ((uint16_t)0x0000)
#define IS_TIM_MSM_STATE_MORT(STATE) (((STATE) == TIM_MasterSlaveMode_Enable_MORT) || \
                                 ((STATE) == TIM_MasterSlaveMode_Disable_MORT))
/**
  * @}
  */ 
/** @defgroup TIM_Remap 
  * @{
  */

#define TIM2_TIM8_TRGO_MORT                     ((uint16_t)0x0000)
#define TIM2_ETH_PTP_MORT                       ((uint16_t)0x0400)
#define TIM2_USBFS_SOF_MORT                     ((uint16_t)0x0800)
#define TIM2_USBHS_SOF_MORT                     ((uint16_t)0x0C00)

#define TIM5_GPIO_MORT                          ((uint16_t)0x0000)
#define TIM5_LSI_MORT                           ((uint16_t)0x0040)
#define TIM5_LSE_MORT                           ((uint16_t)0x0080)
#define TIM5_RTC_MORT                           ((uint16_t)0x00C0)

#define TIM11_GPIO_MORT                         ((uint16_t)0x0000)
#define TIM11_HSE_MORT                          ((uint16_t)0x0002)

#define IS_TIM_REMAP_MORT(TIM_REMAP)	 (((TIM_REMAP) == TIM2_TIM8_TRGO_MORT)||\
                                  ((TIM_REMAP) == TIM2_ETH_PTP_MORT)||\
                                  ((TIM_REMAP) == TIM2_USBFS_SOF_MORT)||\
                                  ((TIM_REMAP) == TIM2_USBHS_SOF_MORT)||\
                                  ((TIM_REMAP) == TIM5_GPIO_MORT)||\
                                  ((TIM_REMAP) == TIM5_LSI_MORT)||\
                                  ((TIM_REMAP) == TIM5_LSE_MORT)||\
                                  ((TIM_REMAP) == TIM5_RTC_MORT)||\
                                  ((TIM_REMAP) == TIM11_GPIO_MORT)||\
                                  ((TIM_REMAP) == TIM11_HSE_MORT))

/**
  * @}
  */ 
/** @defgroup TIM_Flags 
  * @{
  */

#define TIM_FLAG_Update_MORT                    ((uint16_t)0x0001)
#define TIM_FLAG_CC1_MORT                       ((uint16_t)0x0002)
#define TIM_FLAG_CC2_MORT                       ((uint16_t)0x0004)
#define TIM_FLAG_CC3_MORT                       ((uint16_t)0x0008)
#define TIM_FLAG_CC4_MORT                       ((uint16_t)0x0010)
#define TIM_FLAG_COM_MORT                       ((uint16_t)0x0020)
#define TIM_FLAG_Trigger_MORT                   ((uint16_t)0x0040)
#define TIM_FLAG_Break_MORT                     ((uint16_t)0x0080)
#define TIM_FLAG_CC1OF_MORT                     ((uint16_t)0x0200)
#define TIM_FLAG_CC2OF_MORT                     ((uint16_t)0x0400)
#define TIM_FLAG_CC3OF_MORT                     ((uint16_t)0x0800)
#define TIM_FLAG_CC4OF_MORT                     ((uint16_t)0x1000)
#define IS_TIM_GET_FLAG_MORT(FLAG) (((FLAG) == TIM_FLAG_Update_MORT) || \
                               ((FLAG) == TIM_FLAG_CC1_MORT) || \
                               ((FLAG) == TIM_FLAG_CC2_MORT) || \
                               ((FLAG) == TIM_FLAG_CC3_MORT) || \
                               ((FLAG) == TIM_FLAG_CC4_MORT) || \
                               ((FLAG) == TIM_FLAG_COM_MORT) || \
                               ((FLAG) == TIM_FLAG_Trigger_MORT) || \
                               ((FLAG) == TIM_FLAG_Break_MORT) || \
                               ((FLAG) == TIM_FLAG_CC1OF_MORT) || \
                               ((FLAG) == TIM_FLAG_CC2OF_MORT) || \
                               ((FLAG) == TIM_FLAG_CC3OF_MORT) || \
                               ((FLAG) == TIM_FLAG_CC4OF_MORT))

/**
  * @}
  */ 

